app/views/games/show.html.erb

SELECT `guesses`.* FROM `guesses` WHERE `guesses`.`game_id` = 13
---
<h2>The letters you guessed are</h2>
<% @game.guesses.each do |guess| %>