app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
  def index
    @games = Game.all

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 7 LIMIT 1
---
  def show
    @game = Game.find(params[:id])

INSERT INTO `games` (`name`, `created_at`, `updated_at`, `initial_number_of_lives`, `word_to_be_guessed`) VALUES ('heather', '2018-07-04 00:38:01', '2018-07-04 00:38:01', 8, 'role\n')
---
  def create
    @game = Game.new(game_params)
    @game.word_to_be_guessed = GenerateRandomWord.new.words
    @game.initial_number_of_lives = 8
    if @game.save

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
DELETE FROM `games` WHERE `games`.`id` = 1
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy