app/controllers/guesses_controller.rb

  def create
    @game = Game.find(params[:game_id])
    @guess = @game.guesses.create(:letter => guess_params[:letter].downcase)

    if @guess.errors.any?
---
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 8 LIMIT 1
INSERT INTO `guesses` (`guessed_letter`, `game_id`, `created_at`, `updated_at`) VALUES ('a', 22, '2018-06-29 03:17:59', '2018-06-29 03:17:59')
SELECT `guesses`.* FROM `guesses` WHERE `guesses`.`game_id` = 58
SELECT  1 AS one FROM `guesses` WHERE `guesses`.`letter` = BINARY 'w' AND `guesses`.`game_id` = 48 LIMIT 1